//link:https://js.zonayed.me/es6/post-4 
// অ্যারো (Arrow) ফাংশন ও লেক্সিক্যাল(Lexical) ‘this’ কীওয়ার্ড************************
// //a simple function define in es5 style
// function fn(){console.log('hello world');};fn();
// //a function define in es6 style as 
// fn=()=>console.log('hello world');fn();



//অটোম্যাটিক রিটার্নঃ ধরি আমাদের এরকম একটা অ্যারে আছেঃ**************
// //এখন আমি map()ইউজ করে প্রত্যেকটার জন্যে বর্তমান বয়স বের করতে চাই। সময় 2018) তুলনা করে কার কতো বয়স সেটার আরেকটা অ্যারে করতে চাই
// //es5 style 
// const dob = [1996, 1986, 2017, 1989];
// const age=dob.map(function(lol){return 2018-lol});console.log(age);
// //now determine eatch age by es6 style
// const dob = [1996, 1986, 2017, 1989];
// const age=dob.map((lol)=>2018-lol);console.log(age);
// //more compack es6 style
// const age=dob.map(lol=>2018-lol);console.log(age);


//একাধিক আর্গুমেন্টঃ*****************************
// // উপরের উদাহরণে দেখবেন আমাদের শুধুমাত্র একটা আর্গুমেন্টই ছিলো। এখন আমরা জানি map()তিনটা আর্গুমেন্ট নেয়। 
// //এখন একাধিক আর্গুমেন্ট থাকলে অ্যারো ফাংশনে আর্গুমেন্ট গুলো অবশ্যই ()ব্র্যাকেটস এর ভিতরে থাকতে হবে।
// // এখন একটা থাকলেও সেটাকে ব্র্যাকেটস এ ঢুকাতে পারবেন,
// const dob = [1996, 1986, 2017, 1989];
// const age = dob.map((item, index) => `${index}: ${2018 - item}`);console.log(age);


//একাধিক লাইনঃ*************************************
// // এখন আমাদের একাধিক লাইনের কোড থাকলে কি হবে? হ্যাঁ তখন আর অটো রিটার্ন হবে না, আমাদের বলে দিতে
// // হবে returnকীওয়ার্ড ইউজ করে জাস্ট ইএস৫ এর মতোইঃ
// const dob = [1996, 1986, 2017, 1989];
// const age=dob.map(item=>{const old=2018-item; return old;});console.log(age);


//এখন ইএস৫ এর ফাংশন এক্সপ্রেশনের ক্ষেত্রেও আমরা হোইস্টিং এর কারণে একটা ফাংশন ডিফাইন করার আগে
// সেটাকে কল করতে পারি না। ইএস৫ এর ফাংশন স্টেটমেন্ট এ সেটা সম্ভব ছিলো হোইস্টিং এর কারণে। 
//আর ইএস৬ এর অ্যারো ফাংশন ইউজ করতে হলে অবশ্যই আমাদের ফাংশন এক্সপ্রেশন ইউজ করতে হবে।
// সেজন্যে এখানে ফাংশন ডিফাইন করার আগে কল করতে পারবেন না।
// যেমন ইএস৫ এর ফাংশন স্টেটমেন্ট এঃ
fn ();
function fn(){console.log('hello');}
//but es6 style not work
fn2();
fn2=()=>{console.log('hello2');}  //এটা এরর আসবেঃ

