//link:https://js.zonayed.me/daily/post-12 
//জাভাস্ক্রিপ্ট কি সিনক্রোনাস, নাকি অ্যাসিনক্রোনাস? এটা নিয়ে অনেক কনফিউশন থাকলেও 
//জাভাস্ক্রিপ্ট নরমালি সিনক্রোনাস প্রোগ্রামিং ল্যাংগুয়েজই, তবে আমরা যদি রিমোট কোনো সার্ভারে 
//কোনো অপারেশন করতে চাই, বা ইনপুট/আউটপুট টাইপের কোনো অপারেশন করতে চাই যেটাকে 
//আসলে অ্যাজাক্স কল বলে, তখন আসলে জাভাস্ক্রিপ্ট অ্যাসিনক্রোনাস আচরণ করে।
//যত প্রোগ্রামিং ল্যাংগুয়েজ আছে তারমধ্যে বেশীরভাগই হচ্ছে সিনক্রোনাসলি সব কাজ করে। 
//example of sychonus function***********************************************
// const fun=()=>{
//     let x='mahmud';
//     console.log(x);
//     setTimeout((x='hossain')=>{console.log(x);},3000)
//     setTimeout((x='lamyaa')=>{console.log(x);},5000)
//     setTimeout((x='nowsin')=>{console.log(x);},7000)
// }
// fun()
//এখানে মূলত first x= 'mahmud' then 'hossain' ,'lamyaa','nowsin ...
// সেকেন্ড স্লিপ করে তারপর ভ্যালুটা রিটার্ণ করেছে।
//এটা তিন সেকেন্ড ওয়েট করবে, তারপর আমাদের আউটপুট দেখাবে। 
//মূলত সব প্রোগ্রামিং ল্যাংগুয়েজই ঠিক এরকম বিহ্যেইভ করবে যেটাকে সিনক্রোনাস বলে।




//কিন্তু সেইম টাইপের অপারেশনের ক্ষেত্রে জাভাস্ক্রিপ্ট এর অ্যাসিনক্রোনাস আচরণের জন্যে একটু অন্যরকমভাবে কাজ করবে।
//example of asychonus function***********************************
// const fun=()=>{
//     setTimeout(()=>{console.log('i am first inner function');},5000);
//     setTimeout(()=>{console.log('i am second inner function');},3000);
//     setTimeout(()=>{console.log('i am third inner function');},7000);
// console.log('start');

// }
// fun()

//কারণ জাভাস্ক্রিপ্ট এখানে অ্যাসিনক্রোনাস আচরণ করছে। অন্যান্য সব ল্যাংগুয়েজ যেখানে একটার 
//পর আরেকটা ইন্সট্রাকশন ক্রমানুসারে এক্সিকিউট করে যায়, জাভাস্ক্রিপ্ট এ রকম অ্যাজাক্স কলের ক্ষেত্রে 
//ঐরকমটা করে না। জাভাস্ক্রিপ্ট যদি দেখে কোথাও কোনো কোডের ইন্সট্রাকশনের কাজ করতে একটু টাইম লাগছে 
//বা অন্যকথায় কোনো অ্যাজাক্স কল দেখে, তাহলে সেটা সেই অংশে সেই অপারেশন শেষ হওয়া পর্যন্ত অপেক্ষা 
//না করে পরের অপারশনে চলে বাকীগুলো করতে থাকে। এখন এই প্রোগ্রামেও আমরা setTimeoutদিয়ে ৩ 
//সেকেন্ড পরে x এ ভ্যালু অ্যাসাইন করতে বলছি। এখন যেহেতু এখানে ৩ সেকেন্ড টাইম লাগবে, 
//তাই এই অংশটাতে অপেক্ষা না করে পরের বাকি অপারশনগুলো রান হয়ে যায়। এখানে রিটার্ণ স্টেটমেন্ট এ চলে গেছে।
// মানে ভ্যালু রিটার্ণ করে দিয়েছে, যেখানে ভ্যালু হচ্ছে undefinedআর তাই রেজাল্টেও undefinedই দেখাচ্ছে।

//বাস্তব সিচুয়েশনঃ **************************
//এখন এই ধরনের আচরণের জন্যে বাস্তবে কি সমস্যা হতে পারে? হ্যা সেটা নিয়েই এখন বলবো।
// ধরুন আপনি আপনার ওয়েব অ্যাপ্লিকেশনে এমন কোড লিখলেন যেটা আরেকটা সার্ভার থেকে কিছু 
// ডাটা এনে শো করাবে আপনার অ্যাপ্লিকেশনে। এখন আপনি প্রথম লাইনে ডাটা আনলেন।
//  আর পরের লাইনে সেগুলো প্রিন্ট করে দিলেনঃ
//তাহলে এরকম কোড আপনার ঠিকমতো আচরণ করবে না। দেখবেন আপনার ডাটা শো করছে না, 
//undefinedদেখাচ্ছে বা এরর হয়ে যাচ্ছে। কারণ জাভাস্ক্রিপ্ট তো অমুক সার্ভার থেকে ডাটা আসার আগেই 
//ডাটা শো করানোর ইন্সট্রাকশনে চলে গেছে অ্যাসিনক্রোনাস আচরণের কারণে। আর তাই আপনি ঠিকঠাক ফলাফল দেখবেন না।
// তবে এগুলো হ্যান্ডল করার জন্যেও জাভাস্ক্রিপ্ট এ অনেক টেকনিক আছে। যেগুলো পরে আলোচনা করা হবে।
// আর অ্যাসিনক্রোনাস স্বভাব আসলে খারাপ কিছু না। এখানে সময় কম অপচয় হয়।
//  আর এগুলো যেহেতু সুন্দর করে হ্যান্ডেল করার টেকনিকও আছে, তাই কোনো ঝামেলা নাই। 

//asychonus function
// const fn=()=>{console.log('hello');}
// setTimeout(fn,5000)