// link:https://js.zonayed.me/daily/post-4 
// আমরা জাভাস্ক্রিপ্ট এ কখনো কোনো অবজেক্ট থেকে কোনো প্রপার্টি অ্যাক্সেস করতে গেলে দুই উপারে সেটা করতে পারিঃ
// ডট নোটেশান (Dot Notation) and ব্র্যাকেটস নোটেশান (Brackets Notation)
// const obj={
//     name:"mahmud",
//     city:'raj'
// }
//এখন এই অবজেক্ট থেকে যদি আমরা propertyটা অ্যাক্সেস করতে চাই, ডট নোটেশন ইউজ করলেঃ
// console.log(obj.name);
//আর যদি ব্র্যাকেটস নোটেশন ইউজ করিঃ
// console.log(obj['name']);
//দুইটা সেইমভাবেই আউটপুট দিবেঃ



//ডট নোটেশন(Dot Notation)*********************************
// const person={
//     name:'mahmud',
//     age:26,
//     job:'student'
// }
//এখন যদি আমরা এই personঅবজেক্ট থেকে nameপ্রপার্টিটা চাই তাহলে আমাদের ডট নোটশন ইউজ করে 
// console.log(person.name);
//এখন ধরুন আপনাকে আপনার কোডের সরাসরি প্রপার্টির নাম দেওয়ার সুযোগ দেওয়া হলো না।
// বরং আপনার প্রপার্টির নাম একটা ভ্যারিয়েবলের ভিতরে আছে এরকমঃ
// const lol='name';
//এখন আপনি এই ভ্যারিয়েবল ইউজ করে আপনার personঅবজেক্ট থেকে nameপ্রপার্টিটা বের করতে হবে।
// console.log(person.lol);  //output undeine
// রেজাল্ট undefinedদেখাচ্ছে! কিন্তু কেনো? হ্যাঁ এখানেই বুঝার ব্যাপার। 
// আমরা যখন বলেছি আমরা personঅবজেক্ট থেকে একটা প্রপার্টি অ্যাক্সেস করতে চাচ্ছি,
//  তখন সেই প্রপার্টির নাম দিয়েছি personName। যদিও আমাদের এই সেইম নামেই একটা ভ্যারিয়েবল আছে। 
//  কিন্তু এখানে ডট দেওয়ার জাভাস্ক্রিপ্ট আপনার personঅবজেক্ট এর ভিতর থেকে personNameনামেই
//   একটা প্রপার্টি খুঁজবে। কিন্তু আপনার অবজেক্ট এর ভিতরে তো এই নামে কোনো প্রপার্টিই নাই।
//    আর তাই এটা undefinedদেখাচ্ছে।
//but use braket notation
// console.log(person[lol]);




//ব্র্যাকেটস নোটেশন(Brackets Notation)*********************
// এখন ডট নোটেশনের কাজ তো জানলামই। বরং আমরা বেশীরভাবে ক্ষেত্রেই ডট নোটেশন নিয়েই কাজ করবো।
//  কিন্তু ব্র্যাকেটস নোটেশন কখন ইউজ করবো? হ্যাঁ এখন forলুপ ইউজ করে অবজেক্ট থেকে যদি সব প্রপার্টির 
//  ভ্যালু অ্যাক্সেস করতে চাই তাহলে এই ব্র্যাকেটস নোটেশন কাজে লাগে। ধরি আমরা উপরের personঅবজেক্ট এর 
//  সবগুলো প্রপার্টির ভ্যালুগুলো প্রিন্ট করতে চাচ্ছিঃ
// const person={
//     name:'mahmud',
//     age:26,
//     job:'student'
// }
// for (item in person){
//     console.log(item);
// }
//দেখেন এই লুপ ইউজ করে আমরা প্রপার্টি কী গুলোর নাম পাচ্ছি। কিন্তু তাহলে ভ্যালুগুলো কিভাবে পেতে পারি?
// হ্যাঁ এই কীগুলোর নামই ব্র্যাকেটস নোটেশন ইউজ করে ভ্যালুগুলোও পেতে পারি এভাবেঃ
// for (item in person){
//     console.log(person[item]);
// }


//but dot notation not work ,show undefine
// for(item in person){
//     console.log(person.item);
// }