// ফার্স্ট ক্লাস ফাংশন এবং হায়ার অর্ডার ফাংশন নিয়ে কথা বলবো 
// এবং সাথে উদাহরণসহ কিছু ফাংশন তুলে ধরবো যেগুলো থেকে ক্লিয়ার ধারণা পাওয়া যাবে। 
// সবশেষে হায়ার অর্ডার ফাংশন map() এর ব্যবহার দেখাবো।
// জাভাস্ক্রিপ্ট এ ফাংশন কে ফার্স্ট ক্লাস ফাংশন বলা হয়। এখন কথা হলো ফার্স্ট ক্লাস ফাংশন কি?
// ফার্স্ট ক্লাস ফাংশনকে আপনি অন্য কোনো ফাংশনের আর্গুমেন্ট হিসেবে পাস করতে পারবেন,
// এক ফাংশন থেকে আরেকটা ফাংশন রিটার্ন করতে পারবেন। আর সবচেয়ে মজার ব্যাপার হলো 
// ফাংশনকে ভ্যারিয়েবল হিসাবেও স্টোর করতে পারবেন।

//function pass as an argument
//ফাংশনকে আর্গুমেন্ট হিসেবে পাস করাঃ
// const fun1=(name,callback)=>{
//     let age=26;
//     callback(age)
//     console.log(name);

// }

// const fun2=(city)=>{
//     console.log(city);
// }
// fun1('mahmud', fun2);
