//হোইস্টিং(Hoisting) ********************
// // জাভাস্ক্রিপ্ট যাবতীয় ডিক্লেয়ারেশনগুলোকে সবসময় সবকিছুর আগে নিয়ে যায়। এটাই মূলত হোইস্টিং। 
// // এটা যেহেতু ডিফল্ট বিহেভিয়ার তাই হয়তো অনেকজায়গায় এটা নিয়ে লেখা নাও পেতে পারেন।
// // যেহেতু হোইস্টিং ডিফল্ট বিহেভিয়ার, তাই জাভাস্ক্রিপ্ট এ সব ফাংশনগুলো ক্রিয়েশন ফেজে হোইস্টেড করা থাকে। 
// // এজন্যে আসলে আমরা চাইলে একটা ফাংশন ডিক্লেয়ার করার আগে সেটাকে কল করতে পারি।
// fn2();
// function fn2(){
//     console.log('hello');
// }



//কিন্তু ফাংশন এক্সপ্রেশন এইভাবে কাজ করবে না।
//// কারণ ফাংশন এক্সপ্রেশনে আমাদের ফাংশন একটা ভ্যারিয়েবলে 
// //স্টোর করে রাখি। আর সেই ভ্যারিয়েবল ক্রিয়েশন ফেজে undefinedহিসাবে সেট করা হয়। অরিজিনাল ফাংশনটা 
// //পরে এক্সিকিউট হয়, তাই ফাংশন এক্সপ্রেশনের ক্ষেত্রে ডিক্লেয়ারের আগে ফাংশন কল করলে সেটা ফাংশন না বলে
// // এরর দেখাবে। কারণ আসলেই সেটা এই মূহূর্তে ফাংশন না, জাস্ট একটা ভ্যারিয়েবল।
// one();   //output show error
// var one=function(){console.log('hello');}

