//স্কোপ(Scope) নিয়ে ধারণা*****************************
// //স্কোপিং(Scoping) জাভাস্ক্রিপ্ট এ আরেকটা গুরুত্বপূর্ন বিষয়। আপনাকে জানতে হবে আপনার ডিক্লেয়ারকৃত 
// //ভ্যারিয়েবল/ফাংশন আপনি কোথায় কোথায় অ্যাক্সেস করতে পারবেন বা কোথায় কোথায় ইউজ করতে পারবেন।
// // কোনো ভ্যারিয়েবল বা ফাংশন প্রাইভেট করতে চাইলে বা কোনো ভ্যারিয়েবলকে সব জায়গা থেকে অ্যাক্সেস করতে
// // চাইলে কিভাবে বা কোথায় সেটাকে ডিক্লেয়ার করতে হবে এসবকিছুই স্কোপিং এর ভিতরে আলোচনা করবো।
// //জাভাস্ক্রিপ্ট এ প্রধানত দুই ধরনের স্কোপিং হয়ে থাকেঃ
// // ১। লোকাল(Local) স্কোপ
// // ২। গ্লোবাল(Global) স্কোপ



//স্কোপিং এ প্রধান আলোচ্য বিষয়গুলো হচ্ছেঃ*********************
// কোথায় কোথায় আপনি আপনার ভ্যারিয়েবল বা ফাংশনকে অ্যাক্সেস করতে পারবেন
// লেক্সিকাল স্কোপিং(Lexical Scoping) এ প্যারেন্ট-চাইল্ড রিলেশন
// একটা ফাংশনে ডিক্লেয়ারকৃত ভ্যারিয়েবল আরেকটা ফাংশনে যেতে পারবে না, মানে অ্যাক্সেস করতে পারবেন না।



//লোকাল(Local) স্কোপঃ ***************************
// //সাধারণত ফাংশনের ভিতরে ডিক্লেয়ারকৃত ভ্যারিয়েবলগুলো ঐ ফাংশনের লোকাল ভ্যারিয়েবল।
// //  এধরনের ভ্যারিয়েবলগুলোর স্কোপ হচ্ছে লোকাল স্কোপ, অর্থাৎ এই ভ্যারিয়েবলটা শুধুমাত্র ডিক্লেয়ারকৃত 
// //  ফাংশনের ভিতরেই অ্যাক্সেস করা যাবে। এর বাইরে বা অন্যকোনো ফাংশনে অ্যাক্সেস করা যাবে না।
// //example local scope
// fn=()=>{console.log('i am right example of local scope');};fn()   //output show 
// //এটা কল করলে ঠিকঠাক আউটপুট দেখাবেঃ
// //but if i can try this local scope in global call, it show error
// //কিন্তু এখন যদি আমরা এই localভ্যারিয়েবলটাকে এই localScope()এর বাইরে কোথাও 
// //বা অন্য কোনো ফাংশনেও অ্যাক্সেস করতে চাই, তাহলে সেটা অ্যাক্সেস করা যাবে না এবং এক্ষেত্রে রিয়েল এরর পাবেন।
// fn=()=>{var names='mahmd'; console.log(names);};fn();console.log(names);




//২। গ্লোবাল(Global) স্কোপঃ********************************
// // ভ্যারিয়েবল যদি কোনো ফাংশনের ভিতরে ডিক্লেয়ার না করা হয় তাহলে সেটা গ্লোবাল স্কোপে ডিক্লেয়ারকৃত ভ্যারিয়েবল, 
// //মানে ফাংশনের বাইরে যেকোনো জায়গায় ডিক্লেয়ার করা ভ্যারিয়েবলই গ্লোবাল স্কোপ পাবে। 
// //এদেরকে গ্লোবাল ভ্যারিয়েবলও বলা হয়। গ্লোবাল ভ্যারিয়েবল যেকোনো ফাংশনের ভিতরে বা যেকোনো জায়গা 
// //থেকেই অ্যাক্সেস করতে পারবেন
// var names='mahmud';
// fn=()=>{console.log(names);};fn();console.log(names);
// //also call another other function
// fn2=()=>{console.log(names);};fn2()



// //এখন স্কোপিং এর এই আইডিয়া যেমন ভ্যারিয়েবলের ক্ষেত্রে প্রযোজ্য, তেমনি ফাংশন এবং অবজেক্ট এর ক্ষেত্রেও প্রযোজ্য।
// //এর মানে আপনি গ্লোবাল স্কোপে কোনো ফাংশন ডিক্লেয়ার করলে সেটা গ্লোবালি যেকোনো জায়গা থেকেই অ্যাক্সেস করতে পারবেন।
// //সেইমভাবে আপনি যদি কোনো ফাংশনের ভিতরে আরেকটা ফাংশন ডিক্লেয়ার করেন তাহলে ফাংশনের ভিতরে 
// //ডিক্লেয়ারকৃত ফাংশনটা উক্ত ফাংশনের লোকাল স্কোপ পাবে। এবং এই ফাংশন শুধুমাত্র ঐ ফাংশনের ভিতরেই কল
// // করতে পারবেন। বাইরে এর স্কোপ না থাকায় কল করতে পারবেন না।
// fn1=()=>{
//     console.log('i am first function');
//     fn=()=>{console.log('i am second function');}
// }
// fn1()   //only fn1 show ouput ,not fn2 becouse of fn2 is local of fn1,so fn1 is global 

// //but if we access fn2/local then it call locally
// fn1=()=>{
//     console.log('i am function one');
//     fn2=()=>{console.log('i am function two');};
//     fn2();
// }
// fn1();
// //লক্ষ্য করুন আমি লোকাল ফাংশন localFunc()ঐ ফাংশনের ভিতরেই কল করেছি, কারণ এখানেই এটার স্কোপ আছে। 
// //এখন গ্লোবাল ফাংশন anoGlobalFunc()কল করলে দুইটাই এক্সিকিউট হবে।



// //সেইম অবজেক্ট এর ক্ষেত্রেও। কোনো ফাংশনের ভিতরে ডিক্লেয়ার করা হলে সেটা ঐ ফাংশনের লোকাল স্কোপ পাবে।
// // উক্ত ফাংশনের ভিতরে ছাড়া আর কোথাও অ্যাক্সেস করা যাবে না। আর বাইরে গ্লোবাল স্কোপে ডিক্লেয়ার করা
// // হলে সেটা গ্লোবাল স্কোপ পাবে এবং সব জায়গা থেকে অ্যাক্সেস করা যাবে।
// var obj={
//     names:'mahmdu',
//     city:'rajshahi'
// }
// console.log(obj.names);
// // কিন্তু যদি এই অবজেক্ট কোনো ফাংশনের ভিতরে ডিক্লেয়ার করা হয়, তাহলে সেই অবজেক্ট সেই 
// // ফাংশনের লোকাল স্কোপ পাবে এবং শুধুমাত্র সেই ফাংশনের ভিতর থেকেই অ্যাক্সেস করা যাবে।
// fn=()=>{
//    var obj={
//        names:'mahmd',
//        city:'raj'
//     }
//     console.log(obj);
// }
// //এখন এই ফাংশন কল করলে সবকিছু ঠিকঠাক দেখাবেঃ
// fn()
// //কিন্তু এখন যদি এই অবজেক্ট উক্ত ফাংশনের বাইরে অ্যাক্সেস করতে চাই তাহলে এরর আসবে।
// // কারণ এটা লোকাল স্কোপে ডিক্লেয়ারকৃতঃ
// fn=()=>{
//    var obj={
//        names:'mahmd',
//        city:'raj'
//     }
//     console.log(obj);
// }
// fn()
// console.log(obj);

