//স্ট্যাটমেন্ট আর এক্সপ্রেশন****************************
// //আমাদের কোডে মাঝেমধ্যে কিছু লাইন ভ্যালু প্রডিউস করে। যেমন ১০ + ১০ সমান ২০ হয়। 
// // আবার কিছু কোড আছে যেগুলো শুধুমাত্র অ্যাকশন নেয়। যেমন কন্ডিশনাল স্ট্যাটমেন্টগুলো। 
// // এগুলো কোনো ভ্যালু প্রডিউস করে না, জাস্ট কিছু নির্দিষ্ট কিছু অ্যাকশন নেয়। এগুলোর উপর ভিত্তি করেই 
// // আমরা স্ট্যাটমেন্ট আর এক্সপ্রেশনকে পার্থক্য করে থাকি। সোজা বাংলায় এক্সপ্রেশন ভ্যালু প্রডিউস করে আর স্ট্যাটমেন্ট 
// // শুধুমাত্র অ্যাকশন নেয়।

//এক্সপ্রেশনঃ**************************
//// নিচের উদাহরণে ১০ যোগ ১০ করা হয়েছে। এখানে ভ্যালু প্রডিউস হয়েছে যেহেতু তাই এটা এক্সপ্রেশনঃ
// 10 + 10;
// //এক্সপ্রেশন সাধারণত এক লাইনের কোড হয়। পাশাপাশি আরো অনেক কিছু অ্যাড করা যেতে পারে,
// // কিন্তু দিন শেষে একটা একটা ভ্যালু সে প্রডিউস করবেই। নিচের উদাহরণগুটাও এক্সপ্রেশনঃ
// 'Zonayed' + ' ' + 'Ahmed';
//আরো উদাহরনঃ
// console.log(10+10);
// console.log('mahmud'+'hossain');
// null
// true
// talse
// //কিন্তু যখনি আবার এই ভ্যালুগুলো কোথাও অ্যাসাইন করতে যাবেন, তখন সেটা স্টেটমেন্ট হিসেবে গণ্য হবে।
// // যেমন নিচের এই পুরোটা একটা স্টেটমেন্টঃ
//var value = 10 + 10; 
// console.log(value);



//স্ট্যাটমেনটঃ************************************
////আর অন্যদিকে স্ট্যাটমেন্ট জাস্ট কিছু অ্যাকশন নিবে। যেমন লুপ, কন্ডিশনাল স্ট্যাটমেন্টসহ আরো অনেক কিছুঃ
// if(10 < 20) {console.log('Yeah! It is true');} 
// else {console.log('No! It is not True');}
// // উপরের এটা জাস্ট অ্যাকশন নিচ্ছে। ভিতরে থাকা এক্সপ্রেশন অনুযায়ী, 
// // সত্য না মিথ্যা হবে সেটার উপর ভিত্তি করে পার্টিকুলার পার্ট প্রিন্ট করছে


// বিভিন্নরকম ফাংশনঃ***********************
// // আমরা জানি ফাংশনকেও ভ্যারিয়েবলে স্টোর করা যায়। এখন ফাংশনকে যদি ভ্যারিয়েবলে স্টোর করি তাহলে সেটা কি হবে? 
// // এক্সপ্রেশন নাকি স্ট্যাটমেন্ট? হ্যা আমার কথামতো সেটা এক্সপ্রেশনই হবে।


// ফাংশন এক্সপ্রেশনঃ**************************
// // এভাবে ফাংশন নিয়ে সেটা কোনো ভ্যারিয়েবলে স্টোর করলে সেটা ফাংশন এক্সপ্রেশন হবেঃ
// const one=lol=()=>{console.log('hello');}


//ফাংশন স্ট্যাটমেন্টঃ**********************
// আর নরমালভাবে ফাংশন নিলে সেটা ফাংশন স্ট্যাটমেন্ট হবেঃ
// fun=(x,y)=>{
//     if (x==y){console.log(true);}
//     else{console.log(false);}
// }
// fun(2,2)