//link:https://js.zonayed.me/es6/post-3 
//টেমপ্লেট লিটারেল(Template Literal) ও স্ট্রিং মেথড**************************************'
// //আমাদের জাভাস্ক্রিপ্ট এ একটা স্ট্রিং কয়েকটা ভ্যারিয়েবলসহ প্রিন্ট করাতে চাইলে আমাদের সেই ভ্যারিয়েবলগুলোকে কনক্যাট করে নিতে হয় +চিহ্নের সাহায্যে। 
// //এইজন্যেই ইএস এ এসেছে টেমপ্লেট লিটারেল। এর প্রধান কাজ হচ্ছে এই স্ট্রিং কনক্যাটিনেশনের কমপ্লেক্সিটি কমানো।
// // টেমপ্লেট লিটারেলে আমরা এই চিহ্ন ``` (ব্যাকটিক, ট্যাব tabকীর উপরে) ইউজ করে পুরো স্ট্রিং টাকে বেঁধে ফেলি,
// // তারপর ভিতরে কোনো ভ্যারিয়েবল বা সিম্পল ক্যাল্কুলেশন করতে চাইলে ${}এর ভিতরে রাখি।
// const vari=fn=(x,y)=>{
//     let sum=x+y;
//     console.log(`the sum of x and y is : ${x+y}`);
// }
// vari(2,2)


//নতুন স্ট্রিং মেথডঃ*********************************
// //একটা স্ট্রিং কোনো স্পেসেফিক ক্যারেক্টার/স্ট্রিং দিয়ে শুরু হয়েছে কিনা সেটার জন্যে startsWith মেথড
// // একটা স্ট্রিং কোনো স্পেসেফিক ক্যারেক্টার/স্ট্রিং দিয়ে শেষ হয়েছে কিনা সেটার জন্যে endsWith মেথড
// // একটা স্ট্রিং কোনো স্পেসেফিক ক্যারেক্টার/স্ট্রিং আছে কিনা সেটার জন্যে includes মেথড
// // একটা স্ট্রিং স্পেসেফিক অ্যামাউন্টে রিপিট করানোর জন্যে repeat মেথড

//startsWith মেথডঃ********************************
// //আপনার কাঙ্ক্ষিত স্ট্রিং নির্দিষ্ট কোনো ক্যারেক্টার বা ক্যারেক্টার সেট দিয়ে শুরু হয়েছে কিনা সেটা দেখতেই 
// //এই মেথড ইউজ হয়। এটা সবসময় Boolean ভ্যালু trueঅথবা falseরিটার্ন করেঃ
// const start = 'My name is Khan';
// start.startsWith('My');
// const sentence='i love my GOD so much then anything in the universe';
// console.log(sentence.startsWith('i'));



//endsWith মেথডঃ***************************************
// //আপনার কাঙ্ক্ষিত স্ট্রিং নির্দিষ্ট কোনো ক্যারেক্টার বা ক্যারেক্টার সেট দিয়ে শেষ হয়েছে কিনা সেটা দেখতেই
// // এই মেথড ইউজ হয়। এটাও সবসময় Boolean ভ্যালু trueঅথবা falseরিটার্ন করেঃ
// const end = 'I love programming';
// console.log(end.endsWith('My'));



//includes মেথডঃ************************************
// //আপনার কাঙ্ক্ষিত স্ট্রিং নির্দিষ্ট কোনো ক্যারেক্টার বা ক্যারেক্টার সেট আছে কিনা সেটা দেখতেই এই মেথড ইউজ হয়।
// // এটাও সবসময় Boolean ভ্যালু trueঅথবা falseরিটার্ন করেঃ
// const inc = 'I love programming with JavaScript';
// console.log(inc.includes('with'));



//repeat মেথডঃ*****************************************
// //একটা স্ট্রিংকে কয়েকবার রিপিট করতে চাইলে এই মেথড ইউজ করা হয়ঃ
// const rpt = 'Hello World ';
// console.log(rpt.repeat(5));
// //and 
// console.log(`I always want to say ${'Alhamdulillah '.repeat(5)}!`);
// //মনে রাখবেন এটা স্ট্রিং এর মেথড, একমাত্র স্ট্রিং এর সাথেও কাজ করবে, নাম্বার বা অন্যকোনোকিছুর সাথে কাজ করবে না।